---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadOtherParam
source: html/008609e7-5ac2-3991-c75b-05bb2cfd7bb2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadOtherParam Property

"Other Total Estimated Demand"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalestloadOtherParam { get; }
```